export const products = [


  {
    "itemName": "Хлеб Бородинский",
    "description": "Бездрожжевой бородинский хлеб на закваске",
    "image": "https://bonfit.ru/upload/iblock/4ce/4ce456151b72b2b8f6b9a4b90e049bd3.png",
    "image2": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcShTmstdhHxcUlwsKVDpzYvlbxFBBrp1BjiIg&usqp=CAU",
    "image3": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ0pR9lYrLL6foi2hJVTthl0imMjSe06TGHCw&usqp=CAU",
    "id": 0,
    "ingredients": [
      {
        "doughTitle": "Тесто: "
      },
      {
        "name": "заварка солодовая",
        "amount": 60
      },
      {
        "name": "закваска ржаная",
        "amount": 100
      },
      {
        "name": "мука пш.",
        "amount": 85
      },
      {
        "name": "мука ржаная",
        "amount": 100
      },
      {
        "name": "вода",
        "amount": 85
      },
      {
        "name": "дрожжи",
        "amount": 1.5
      }
    ],
    "detailsProcess": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Hic, quisquam autem omnis, vel eligendi corporis eaque tempora molestias tempore voluptatem non porro, earum nobis placeat quas nulla numquam minima unde culpa mollitia iste. Quod a odit modi esse cumque optio atque voluptatum fugit illum, ab nisi commodi rem aliquam nam. Eveniet unde quibusdam numquam nisi possimus vel. Ad sunt dolorem deleniti optio cumque adipisci quasi corrupti possimus ducimus nihil sint, reprehenderit non, sit natus harum nulla velit eligendi quisquam. Officia unde deleniti error. Minus tenetur asperiores, quasi quo dignissimos, officiis, praesentium est reprehenderit nulla error ad ut. Ipsum, dolor commodi?",

    "category": "bread"
  },




  {
    "itemName": "Хлеб Дарницкий",
    "description": "Хлеб бездрожжевой на ржаной закваске.</br> Прозводится согласно рецептуре соответствующей стандарту качества",
    "image": "https://calorizator.ru/sites/default/files/imagecache/product_512/product/bread-93.jpg",
    "id": 1,
    "ingredients": [
      {
        "doughTitle": "Тесто: "
      },
      {
        "name": "мука пш.",
        "amount": 150
      },
      {
        "name": "мука ржаная",
        "amount": 120
      },
      {
        "name": "вода",
        "amount": 170
      },
      {
        "name": "закваска ржаная",
        "amount": 220
      },
      {
        "name": "соль",
        "amount": 7
      },
      {
        "name": "тростниковый сахар",
        "amount": 20
      },
      {
        "name": "дрожжи сух.",
        "amount": 1.5
      }
    ],
    "detailsProcess": " О ЗАМЕСЕ<br>Пшенично-ржаное тесто имеет свои особенности в работе и, в зависимости от того, какой в нем процент ржаной муки, по-разному замешивается и бродит. Чем больше в тесте ржаной муки, темболее вязким, липким будет его консистенция, и свойства теста тоже будут другими.Химический состав ржаной муки определяет особенности приготовления ржаного теста. При замесе ржаного теста ВАЖНО быстро и хорошо смешать ингредиентыВ ржаном тесте нет клейковинного каркаса, свойственного пшеничному тесту, поэтому онополучается вязким, пластичным. Упругие свойства в нем слабо выраженыЗамес теста на густой закваскеГустая закваска должна иметь влажность 48-50%, кислотность 13-16 град из ржаной обойной или 11-14 град из ржаной обдирной муки.ВА ВАРИАНТА замеса теста на густой закваске:  внести 25-33% муки брожения теста осуществлять 75-120 мин;внести 40-60% муки время брожения сократить до 30-60 мин.Этот способ рекомендуется применять при приготовлении теста из ржаной обойной и обдирной муки, а также из смеси разных сортов ржаной и пшеничной мукиЗамес теста на жидкой закваскеВлажность закваски 70 -85%, кислотность 9 – 10 град.На такой закваске можно вырабатывать хлеб из ржаной муки и смеси разных сортов ржаной и пшеничной муки.Джеффри Хамельман (30 лет работает пекарем, автор книг по хлебопечению) СОВЕТУЕТ:   Тесто с содержанием ржаной муки от 50 до 70% вымешивать 2-3 минуты на первой или второй скорости.Если ржаной муки в тесте еще больше — от 70 до 90%, то замешивать 4 минуты на первой скорости или 2 минуты на второй.Для 100% ржаного теста для того, чтобы все ингредиенты хорошо распределились, замешивать около 10 минут на первой скорости.Простое ржаное тесто готовят в ДВЕ ФАЗЫ : закваска — тесто. Для улучшенных, заварных сортов (вроде Бородинского) в ТРИ ФАЗЫ: заварка, закваска, тесто.оль и закваску необходимо предварительно растворить в воде для более равномерного перемешивания с мукой. Так как интенсивность замешивания ржаного теста может привести к тому, что тесто станет жидким.Соль играет важную роль в замесе теста. Она тормозит набухание и пептизацию белков, повышает температуру клейстеризации крахмала в процессе выпечки.В ржаном тесте различают три фазы: твердую, жидкую и газообразную. Причем, по сравнению с пшеничным, в нем меньше доля твердой и газообразной и больше доля жидкой фазы.ереход белков ржаной муки в тесте в растворимое состояние зависит от кислотности.  НЕ ПУТАЙТЕ КИСЛОТНОСТЬ и КИСЛОСТЬ ТЕСТА.овышение кислотности теста до 10—12 градусов способствует пептизации белков и образованию вязкой жидкой фазы. Поэтому повышенная кислотность ржаного теста благоприятно влияет на физические свойства ржаного теста, особенно на тесто из ржаной муки с низким содержанием белковых веществ.О ФЕРМЕНТАЦИСразу после замеса ржаному тесту необходима ферментация. Температура на время ферментации должна быть довольно высокой — 29-30°СЗа короткое время должен закончиться процесс брожения и достаточно вырасти кислотность теста. Но если время брожение затянется – накапливается излишняя кислота и тесто разжижается.40% ржаной муки - 60 минут ",
    "category": "bread"
  },


  {
    "itemName": "Круасcан",
    "description": "Французский круасcан по классической рецептуре на кефире",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQyulwap_tBm07pYnFFsWo9v1L30TzTRgDLMg&usqp=CAU",
    "id": 2,
    "ingredients": [
      {
        "doughTitle": "Тесто: "
      },
      {
        "name": "мука пшеничная в/с",
        "amount": 90,
      },
      {
        "name": "дрожжи пресованные",
        "amount": 3,
      },
      {
        "name": "молоко",
        "amount": 20,
      },
      {
        "name": "вода",
        "amount": 20,
      },
      {
        "name": "сахар",
        "amount": 8,
      },
      {
        "name": "масло сл. слив 82%",
        "amount": 5,
      },
      {
        "name": "яйцо",
        "amount": 6,
      },

    ],
    "category": "croissants"

  },
  {
    "itemName": "Круассан сливочный 5-ти слойный",
    "description": "Французский круассан особой рецептуры на сливочном масле",
    "image": "https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_6560e721dc9c9160243429f5_6560ec021579133d0f5db7ab/scale_1200",
    "id": 3,
    "ingredients": [
      {
        "doughTitle": "Тесто: "
      },
      {
        "name": "мука пш. французская",
        "amount": 1200
      },
      {
        "name": "дрожжи сух.",
        "amount": 16
      },
      {
        "name": "сахар",
        "amount": 120
      },
      {
        "name": "соль",
        "amount": 20
      },
      {
        "name": "вода",
        "amount": 300
      },
      {
        "name": "молоко",
        "amount": 300
      },
      {
        "name": "яйца",
        "amount": 80
      },
      {
        "name": "масло сл. 82%",
        "amount": 80
      }
    ],
    "category": "pie"
  },
  {
    "itemName": "Тартин",
    "description": "Хлеб бездрожжевой из цельнозерновой пшеничной муки",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRyj483hD-L5OSmKQ-GtPXYrIkCgNZ8DhHD0h_TAfIixvOKHvlSdRqcVBtF0t3Vv9Xmf9I&usqp=CAU",
    "id": 4,
    "ingredients": [
      {
        "doughTitle": "Тесто: "
      },
      {
        "name": "мука пш. итальянская",
        "amount": 338
      },
      {
        "name": "мука пш. цельнозерновая",
        "amount": 38
      },
      {
        "name": "закваска пш. цельнозерн.",
        "amount": 63
      },
      {
        "name": "вода",
        "amount": 257
      },
      {
        "name": "дрожжи сух.",
        "amount": 1
      },
      {
        "name": "соль",
        "amount": 7
      }
    ],
    "detailsProcess": " Lorem ipsum dolor sit amet consectetur adipisicing elit. Beatae vel illo dicta molestias accusantium? Eos corporis quam quibusdam quod temporibus nulla ab omnis eaque. Dicta eligendi libero possimus sapiente, ipsam, quidem necessitatibus magni, illum soluta perferendis natus! Modi et provident, possimus vero dolores quod sequi eaque! Rem cum dignissimos quod at, deleniti officiis, illum tempora qui fugiat, similique eaque doloribus.",
    "category": "bread"
  },
  {
    "itemName": "Кекс банановый",
    "description": "bananoviy keks bananoviy keks bananoviy keks",
    "image": "https://nehudeem.ru/wp-content/uploads/2017/02/bananhleb11-1024x715.jpg",
    "id": 5,
    "ingredients": [
      {
        "doughTitle": "Тесто: "
      },
      {
        "name": "мука",
        "amount": 200
      },
      {
        "name": "яйца",
        "amount": 2
      },
      {
        "name": "сахар",
        "amount": 100
      },
      {
        "name": "соль",
        "amount": 3
      },
      {
        "name": "бананы",
        "amount": 250
      },
      {
        "name": "маргарин",
        "amount": 100
      },
      {
        "name": "разрыхлитель",
        "amount": 5
      },
      {
        "name": "тростниковый сахар",
        "amount": 10
      },
      {
        "name": "грецкий орех",
        "amount": 50
      }
    ],
    "category": "pie"
  },
  {
    "itemName": "Ромовая баба",
    "description": "Удивительно вкусное ромовое лакомство дополнит твой кофе! Ромовая баба в сахарной помадке - это нечто! Кексы имеют влажную текстуру и очень кстати к чаю или кофе. А еще они, приготовленные по ГОСТу, совсем как те, в детстве.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTaLngCV8iijrk2xJdwGa1M_9aCzDxM4gHO3baVbWsTZ9BsrtgGVFgNkvn78CW8GymvlKc&usqp=CAU",
    "id": 6,
    "ingredients": [
      {
        "doughTitle": "Тесто: "
      },
      {
        "name": "мука",
        "amount": 35
      },
      {
        "name": "вода",
        "amount": 12
      },
      {
        "name": "дрожжи сух.",
        "amount": 1
      },
      {
        "name": "масло сл. 82%",
        "amount": 8
      },
      {
        "name": "сахар",
        "amount": 9
      },
      {
        "name": "яйца",
        "amount": 5
      },
      {
        "name": "соль",
        "amount": 0.2
      },
      {
        "name": "ванилин",
        "amount": 0.5
      },
      {
        "name": "изюм",
        "amount": 5
      }
    ],
    "category": "bread",
    "detailsProcess" : `
      Высыпаем изюм в небольшую пиалу, заливаем его ромом и оставляем разбухать в течение 3 часов.

Выкладываем дрожжи в мисочку, заливаем теплой водой, добавляем соль и сахар, перемешиваем и оставляем на время (около 10 минут).

В большую миску, в которой будем замешивать тесто, просеиваем муку, вбиваем яйца, вливаем дрожжевую смесь, выкладываем размягченный маргарин. Замешиваем тесто. Оно не должно быть тугим, а наоборот - имеет липкую консистенцию.

Вымешивать тесто до эластичного состояния следует около 40 минут (мука во время вымешивания не добавляется!) Месить тесто можно руками или с помощью кухонного комбайна, хлебопечки. Когда тесто начнет отлипать от рук и растягиваться, не разрываясь при этом, оно готово. Оставляем тесто подходить под салфеткой на 40-45 минут.

Извлекаем изюм из рома, вводим его в тесто, оставляем еще раз на полчаса.

Затем в смазанные формочки выкладываем тесто, заполняя их примерно на 1/3 от общего объема. Оставляем подходить на 15 минут.

Разогреваем духовку до 180 градусов и отправляем кексы запекаться на полчаса.
Готовые кексы извлекаем из формочек и каждый протыкаем зубочисткой.

Пока кексы остывают варим сироп:
- воду смешиваем с сахаром, кипятим пару минут;
- в немного остывший сироп вливаем ром.

Каждый кекс окунаем в сироп, чтобы они хорошо пропитались.

Приготовим сахарную помадку:
- варим сахар с водой, доведя до кипения, убавляем газ, увариваем до готовности. Готовность проверяем до пробы на мягкий шарик (капаем в холодную воду сироп, если капля превратится в мягкий шарик, сироп готов);
- добавляем в готовый сироп лимонную кислоту;
- остужаем, поставив емкость с помадкой в посудину с холодной водой, непрерывно помешивая. Сначала масса поредеет, затем - побелеет и только после этого начнет густеть, что и будет свидетельствовать о готовности помадки.

Каждый кекс поливаем помадкой, даем застыть и угощаем друзей!
    `
  },

  {
    "itemName": "Чиабатта",
    "description": "Не пугает долгий процесс приготовления? Попробуй итальянский хлеб! Для истинных ценителей итальянской кухни. Это действительно очень вкусный хлеб. Хрустящая корочка с мягким и ароматным мякишем.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQYwAmBwqAcRzh7zavXxioHNl8b0nHfOPj8EIfPVqguwq_qij4xhKt2YmCPyyIQa6CUJos&usqp=CAU",
    "id": 7,
    "ingredients": [
      {
        "doughTitle": "Тесто: "
      },
      {
        "name": "мука",
        "amount": 300
      },
      {
        "name": "дрожжи сух",
        "amount": 4
      },
      {
        "name": "вода",
        "amount": 225
      },
      {
        "name": "соль",
        "amount": 5
      },
      {
        "name": "сахар",
        "amount": 5
      }
    ],
    "category": "bread",
    "detailsProcess" : `
    
    1. Начните готовить закваску. Положите в банку по 25 грамм ржаной и пшеничной муки и залейте 100 мл сока. Банку прикройте крышкой и оставьте при комнатной температуре на 48 часов. Через 24 часа перемешайте.

2. Время прошло - вы увидите, что закваска стала пузыриться. Вылейте половину смеси и добавьте снова 100 мл сока и по 25 грамм ржаной и пшеничной муки. Оставьте еще на сутки.

3. Повторите: вылейте половину смеси и добавьте 100 мл сока и по 25 грамм ржаной и пшеничной муки. Оставьте еще на сутки.

4. В течение 6 дней освежайте закваску (каждый день), выливая половину смеси и добавляйте 100 мл воды и по 25 гр ржаной и пшеничной муки. Если хотите приготовить пшеничную чиабатту, добавляйте на этом этапе только пшеничную муку (50 гр).

5. Готовую закваску поставьте в холодильник и освежайте ее как и прежде, но 1 раз каждые 48 часов в течение 5-14 дней.

6. Приготовьте тесто. Возьмите 510 мл закваски, муку, воду, молоко и растительное масло. Перемешайте миксером и дайте настояться 20 минут. Добавьте соль, перемешайте и оставьте на 4 часа. Не забывайте каждый час перемешивать тесто.

7. Отстоянное тесто накройте пленкой и поставьте в холодильник на 10-12 часов.

8. Время прошло - тесто присыпьте мукой, разделите на 2 части.

9. Выпекайте на пергаментной бумаге, присыпанной мукой или манкой. Чиабатта выпекается при 230 градусах в течение 15 минут. При выпекании накройте форму фольгой.

10. Уберите фольгу, выпекайте при 210 градусах еще 15 минут.

Приятного аппетита!`
  },
  {
    "itemName": "Сочень с творогом",
    "description": "Домашние сочники из нежного песочного теста на сметане с воздушной творожной начинкой. Таких сочников в магазине не купишь!",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRwST2MtDtFTvoednu5MGC-Dc2iPADLP5Z7_1Z2kXTgVAnMoiBhCtLxNO3-ZxA_6encTIM&usqp=CAU",
    "id": 8,
    "ingredients": [
      {
        "doughTitle": "Тесто песочное: "
      },

      {
        "name": "мука пш.",
        "amount": 50
      },


      {
        "name": "сахар",
        "amount": 11
      },

      {
        "name": "масло сл. 82%",
        "amount": 20
      },

      {
        "name": "яйца",
        "amount": 8
      },

      {
        "name": "сметана",
        "amount": 10
      },


      {
        "name": "соль",
        "amount": 0.3
      },

      {
        "name": "разрыхлитель",
        "amount": 1
      },

      {
        "addIng": "Начинка творожная :"
      },

      {
        "name": "творог",
        "amount": 50,
      },

      {
        "name": "сахар",
        "amount": 10,
      },

      {
        "name": "ванилин",
        "amount": 10,
      },

      {
        "name": "яйцо",
        "amount": 0.5,
      },

      {
        "name": "сметана",
        "amount": 3,
      },

      {
        "name": "мука пш.",
        "amount": 5,
      },
    ],
    "category": "bread"
  },
  {
    "itemName": "Шарлотка с яблоками",
    "description": "just a pie with apples",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS00QmLtM2c2h6VDN6kU6KVuO-J3r1Xk5WVBinMSK5ntG8srPhPyNotJcDrhn2EQL7P1Xs&usqp=CAU",
    "id": 9,
    "ingredients" : [
      {
        name: "мука",
        amount: 300
      },

            {
        name: "сахар",
        amount: 300
      },

            {
        name: "яйцо",
        amount: 400
      },

            {
        name: "яблоки",
        amount: 400
      },

            {
        name: "разрыхлитель",
        amount: 10
      },

            {
        addIng: "Основа в формочке: "
      },

            {
        name: "сахар тростниковый",
        amount: 15
      },

                  {
        name: "ябоко",
        amount: 40
      },


      
    ],

    "category": "pie"
  },
  {
    "itemName": "Баноффи пай",
    "description": "Баноффи — английский пирог, приготовленный из бананов, сливок, карамели и варёного сгущённого молока.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSmAUm-K_XjG7dk1mOrr3P-pVeJXxb2XQoC_71bN8viMMEULfxxkjMwpbIOpBF9bAwPx2o&usqp=CAU",
    "id": 10,
    
      "ingredients" : [
        {
          addIng: "Основа: "
        },
        
        {
          name: "печенье крошка",
          amount: 220
        },

       {
          name: "фундук крошка",
          amount: 100
        },

        {
          name: "масло сл. слив 82%",
          amount: 150
        },

        {
          addIng: "Крем: "
        },

        {
          name: "маскарпоне",
          amount: 500
        },

        {
          name: "сливки 33%",
          amount: 100
        },

         {
          name: "сахар пудра",
          amount: 60
        },

         {
          addIng: "Солёная карамель: "
        },
        {
          name: "сахар песок",
          amount: 200
        },

        {
          name: "вода",
          amount: 50
        },

         {
          name: "сливки 33%",
          amount: 100
        },

         {
          name: "масло сл. слив 82%",
          amount: 65
        },

      ],
   	"detailsProcess": `
    Начнём с основы. Она похожа на ту, что мы делаем для чизкейков. Но давайте слегка её усложним. Измельчаем в блендере песочное печенье (120 г). Берите покупное, домашнее, белое, шоколадное, всё, что под руку попадётся. Нет блендера? Берите скалку, печенье в пакет и, как следует разозлившись, покажите, кто главный.

Пересыпаем в чашку, а в блендер отправляем солёную соломку (50 г). Здесь допустимо взять крендельки, но именно с солью, тогда вкус основы будет очень интересным. Кстати, в этот раз можно измельчить не в пыль, а просто до кусочков в 2-3 мм. Если нет соломки и кренделей, а в магазин идти сильно лень, замените всё тем же печеньем.

Снова пересыпаем к печенью. Видите разницу в кусочках?

Растапливаем сливочное масло (100 г) в микроволновке. И выливаем в чашку в печеньем. Лучше не вливайте всё масло, чтобы основа не получилась слишком влажной.

Налили какую-то часть и перемешиваете.

Нам нужна текстура мокрого песка.

Собирать можно в разъемной форме, в фарфоровой чаше (если планируете прям из неё есть десерт), я пользуюсь кольцом и ковриком, потому что ленивый. Диаметр 16-18 см. Если у вас форма больше, удваивайте ингредиенты.

Я простелил борта ацетатной плёнкой (она всегда есть в магазине моём). Секрет — протереть кольцо внутри влажной салфеткой. Тогда плёнка будет буквально прилипать к стенкам кольца и бока будут идеально гладкие потом. Высыпаем нашу крошку в кольцо.

И распределяем ложкой по дну и бортикам. Толщина на ваш вкус, я делал около 6-7 мм. Если делать толще — будет жестковато. Когда массу распределили, утрамбовываем её. Для этого у меня стакан с плоским дном. 

Основа готова, можно убрать в холодильник.

Сварим карамель. У меня есть отдельный рецепт в Хозяйке на заметку, поэтому здесь я только пройдусь кратко по ингредиентам, сам процесс (если вдруг вы ещё не научились) читайте там.

Итак в сотейник с толстым дном насыпаем сахар (200 г), любой, который больше любите. Влейте туда же 50 г воды. Вообще, здорово бы делать сухую карамель, технология есть у меня в Карамельном латте, но для простоты делаем с водой.

Ставим на плиту и варим до появления карамельного цвета, помните, как в детстве варили леденцы?) Не помешивайте сахар, он схватится. Только сам сотейник иногда взбалтывайте.

Убираем с огня. Добавляем кусочки холодного сливочного масла (80 г) и вливаем тёплые сливки (120 г, только 33% жирности). Осторожно, масса будет прилично пениться.

Размешиваем активно лопаткой до однородности. У вас получится тот самый карамельный соус. Выливаем его в нашу базу. Слой такой, как вам нравится, остальное можно хранить в бутылочке неделями. Если карамель варить лень, берите варёную сгущенку.

Сверху аккуратно выкладываете слайсы банана. Я люблю бананы, поэтому выложил аж два слоя толстых слайсов.

Сверху покрываем любым лёгким кремом. У меня творожный сыр (который Хохланд, заменяем Маскарпоне) и сливки (по 100 г), сливки (33%) взбил до плотных пиков, добавил сыр и взбил миксером. Можно просто сливками покрыть, можно любой крем взять из моих.

Дайте десерту постоять пару часов в холодильнике.
  `,
    "category": "pie"
  },
  {
    "itemName": "Лимонный тарт",
    "description": "Прекрасный лимонный пирог",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS-JcRBR1IlMwl2UIAN9p9e0tQiIMQF_fEjGk130Kkz6nY7bRQ6roDdi-rVG-wWjn3IKCM&usqp=CAU",
    "id": 11,
    "ingredients" : [
      {
        addIng: "Основа: "
      },
      {
        name: "мука пш.",
        amount: 420
      }, 
      {
        name: "сахар песок",
        amount: 230
      }, 
      {
        name: "маргарин",
        amount: 250
      }, 
      {
        name: "сметана 20%",
        amount: 180
      }, 
      {
        name: "разрыхлитель",
        amount: 5
      }, 
            {
        name: "загуститель",
        amount: 15
      }, 
      {
        addIng: "Лимонная начинка: "
      },

                  {
        name: "лимоны свежие",
        amount: 350
      }, 

                  {
        name: "сахар",
        amount: 300
      }, 

                  {
        name: "загуститель",
        amount: 50
      }, 
    ],
    "detailsProcess" : `
      

Полный текст: 
    `,
    "category": "pie"
  },
  {
    "itemName": "Чизкейк классический",
    "description": "Классический рецепт чизкейка в духовке. Можно использовать как основу для приготовления разновидностей этого лакомства.",
    "image": "https://vsedoma-family.ru/sites/default/files/styles/product/public/product/f8bfddda8e19625d5d5a625987dd3ca7.jpg?itok=_P-pTXCy",
    "id": 12,
    "ingredients" : [
      {
        addIng: "Основа: "
      },
      {
        name: "печенье крошка",
        amount: 300
      },
      {
        name: "фундук крошка",
        amount: 60
      },
      {
        name: "масло сл. слив. 82%",
        amount: 300
      },
      {
        addIng: "Начинка: "
      },
      {
        name: "маскарпоне",
        amount: 600
      },
      {
        name: "сливки 33%",
        amount: 300
      },
      {
        name: "яйцо",
        amount: 150
      },
      {
        name: "сахар песок",
        amount: 150
      },
      {
        name: "лимонный сок",
        amount: 10
      },
    ],
    "detailsProcess" : `
     1) 
     Предварительно разогреть духовку до 180 градусов. Смазать маслом разъемную форму для торта.
Блендером хорошо измельчить печенье. Добавить растопленное сливочное масло, сахар и соль, хорошо перемешать.
2) 
Выложить полученную массу в форму, придавливая пальцами, равномерно распределить по дну и краям.
Поместить форму с основой чизкейка в духовку. Температуру уменьшить до 150 градусов. Выпекать 12-15 минут. Затем остудить на решетке.

3)
Миксером на средней скорости взбить сливочный сыр (комнатной температуры). Постепенно добавить сахар, лимонную цедру, лимонный сок и соль.
Вбить по одному яйца, добавить сметану. Взбить до однородности.

4)
Форму с основой из печенья завернуть снизу в фольгу. Вылить на основу приготовленную начинку, слегка стукнуть о стол, чтобы убрать пузырьки воздуха.
Поставить форму в глубокий противень. Налить в противень кипяток таким образом, чтобы вода доходила до 1/2 высоты формы.

5)
Поместить чизкейк в разогретую до 200 градусов духовку сперва на 10-15 минут. Затем уменьшить температуру до 110-120 градусов и довести чизкейк в духовке до готовности, около 1,5 часа.
Вынуть форму из воды, оставить чизкейк в выключенной духовке минут на 20. Затем оставить чизкейк при комнатной температуре до полного остывания.
Острием ножа провести по стенкам, отделяя чизкейк от бортиков формы. Поместить чизкейк в форме в холодильник на несколько часов (на ночь). Затем аккуратно снять форму и можно чизкейк подавать.
    `,

    "category": "pie"
  },

  {
    "itemName": "Брауни пай",
    "description": "Классическая рецептура великолепного шоколадного десерта",
    "image": "https://img.iamcook.ru/2020/upl/recipes/cat/u-350b1fd89240624e1b382107ac6e64e2.JPG",
    "id": 13,
    "ingredients": [
      {
        "name": "масло сл. 82%",
        "amount": 60
      },
      {
        "name": "шоколад",
        "amount": 200
      },
      {
        "name": "мука пш.",
        "amount": 30
      },
      {
        "name": "разрыхлитель",
        "amount": 5
      },
      {
        "name": "какао",
        "amount": 30
      },
      {
        "name": "яйца",
        "amount": 100
      },
      {
        "name": "тростниковый сахар",
        "amount": 140
      },
      {
        "name": "оливковое масло",
        "amount": 30
      },
      {
        "name": "сметана",
        "amount": 60
      },
      {
        "name": "сгущенное молоко",
        "amount": 200
      }
    ],
    "detailsProcess" : `
      1)
В сотейнике растопить сливочное масло, добавить шоколад, можно убрать с огня и быстро перемешать массу, следя за тем, чтобы шоколад не расслоился.
2)
Отдельно взбить яйца с сахаром до белой пены. Туда же влить тонкой струйкой шоколадную массу. Всыпать муку и орехи, осторожно лопаткой все смешать.
3)
Форму (16-18 см) обвернуть фольгой, борта смазать сливочным маслом, влить тесто и печь в разогретой до 150 градусов духовке до готовности.
4)
Мусс: Пока тесто в духовке, желатин замочите в очень холодной воде 10-15 минут до разбухания. Банан разомните вилкой.
5)
Шоколад положить в мерный стакан, молоко довести до кипения, сразу налить на шоколад, добавить отжатый желатин, затем банан, пробить блендером до состояния эмульсии. Отдельно взбить холодные сливки, затем все осторожно перемешать.
6)
Остывший брауни обвернуть ацетатной плёнкой. Банан нарезать и положить на брауни, сверху вылить мусс и убрать в холодильник на 4-5 часов.
7)
Готовый брауни можно декорировать какао и элементами шоколада. Так как у меня не было времени на декор, я взяла готовый плиточный шоколад, растопила его несколькими ложками молока и вылила поверх брауни.

    `,
    "category": "pie"
  },
  {
    "itemName": "Тыквенный пирог",
    "description": "Американский тыквенный пирог - вкусная и нежная выпечка с богатым вкусом и ароматом.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRi7caaJtskPC8W2Exk_kMaf_c5iPcLggHnPfrsrehcqZdSB05_vhZj0vb-G13RafcX3eM&usqp=CAU",
    "id": 14,
    "ingredients": [
      {
        "name": "тыква",
        "amount": 300
      },
      {
        "name": "лимон",
        "amount": 1
      },
      {
        "name": "яйца",
        "amount": 3
      },
      {
        "name": "мука",
        "amount": 230
      },
      {
        "name": "сахар",
        "amount": 150
      }
    ],
    "detailsProcess" : `
      1) Просеять муку и соль в глубокую миску. Перетереть между ладоней с мягким маслом, чтобы смесь напоминала хлебные крошки, затем добавить слегка взбитое яйцо и замесить тесто. Скатать его в шар, завернуть в пленку и отправить в холодильник на 30–50 минут. Если тесто не собирается в шар и рассыпается, добавить 1–2 чайных ложки холодной воды.

2) Очистить тыкву, удалить семена. Нарезать мякоть кубиками. Положить в кастрюлю с толстым дном или сотейник, добавить немного воды и тушить до мягкости и полного испарения жидкости. Блендером измельчить мякоть в однородную массу. Для пущей нежности получившееся пюре можно протереть через сито.



3) Раскатать тесто на слегка присыпанной мукой поверхности и застелить им круглую низкую форму диаметром около 25 см. Поверх теста положить лист бумаги для запекания и засыпать любую крупу. Это позволит коржу равномерно пропечься. Выпекать в течение 15 минут при 190 градусах.

4) Выложить тыквенное пюре в глубокую миску, взбить с двумя яйцами, сахаром, сливками, пряностями и солью. Вылить смесь в форму с запеченным тестом. Выпекать пирог 50–55 минут при 180 градусах. Когда пирог остынет, его можно смело разрезать на порции.
    `,
    "category": "pie"
  },



    {
    itemName: "Кулич пасхальный",
    description: "Кулич",
    image: "https://slastenabakery.ru/image/cache/catalog/tovar/kulich-100-652x495.jpg",
    id: 15,
    ingredients: [
      {
        name: "мука",
        amount: 550
      },
      {
        name: "вода",
        amount: 200
      },
      {
        name: "дрожжи пресс",
        amount: 30
      },
      {
        name: "маргарин даймонд",
        amount: 70
      },
      {
        name: "сахар",
        amount: 80
      },
      {
        name: "яйца",
        amount: 60
      },
      {
        name: "соль",
        amount: 3
      },
      {
        name: "ванилин",
        amount: 5
      },
      {
        name: "смесь сухофруктов",
        amount: 200
      },
    ],
    category: "pie"
  },

  {
    itemName: "Маффины",
    description: "Шоколадные кексы ",
    image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQYBh3JIgyrcXi4xSYX71am0FkGUP2L4vJ8o1ziJ8TY2jXcMdF3w4BKuq31UIWuTeyFgTY&usqp=CAU",
    id: 16,
    ingredients: [

      {
        doughTitle: "Тесто: "
      },

      {
        name: "мука пшеничная В/С",
        amount: 200
      }, 
      {
        name: "сахар песок",
        amount: 150
      }, 
      {
        name: "яйцо",
        amount: 100
      }, 
      {
        name: "масло сл. сливочное 72%",
        amount: 150
      }, 
      {
        name: "йогурт",
        amount: 200
      }, 
      {
        name: "ягода сезонная замороженная",
        amount: 160
      }, 
      {
        name: "разрыхлитель",
        amount: 5
      }, 
    ],
    category: "pie",
    detailsProcess: `Настоящие английские маффины напоминают, скорее, плоскую лепешку, чем кекс. Перед подачей на стол маффин поджаривают на открытом огне.
    
К концу XIX в. технология приготовления маффинов претерпела изменения: появились кольца  «Маффин-рингс», которые выкладывались на противни для того, чтобы добиться гладкости краев лепешек.

По традиции, маффины подаются в Англии к пятичасовому чаю. Также к маффинам подают повидло, либо муссы.



Тесто для маффинов готовится заранее.

Изабелла Битон, один из первых кулинарных писателей, так описывала процесс приготовления теста:

«Если булки готовят к обеду или второму завтраку, то тесто должно быть готово примерно в 8 часам утра; если маффины нужны на завтрак, то тесто следует приготовить заранее поздним вечером».

Запекают в печи, либо на открытом огне, в мангалах.`
  },

  {
    itemName: "Булочка с маком",
    description: "Изумительно нежное лакомство прямиком из Вашего детства. Рецептура старых советских маковых булочек",
    image: "https://hlebopechka.ru/forum/result-photo/552576.jpg",
    id: 17,
    ingredients: [
      {
        doughTitle: "Тесто сдобное:"
      },

      {
        name:"мука пшеничная В/С",
        amount: 430
      }, 

      {
        name:"сахар песок",
        amount: 50
      }, 
      {
        name:"дрожжи пресованные",
        amount: 35
      }, 
      {
        name:"молоко",
        amount: 130
      }, 
      {
        name:"яйцо",
        amount: 75
      }, 
      {
        name:"соль",
        amount: 3
      }, 
      {
        name:"масло сл. сливочное 82%",
        amount: 80
      },  
      {
        name:"ванильный сахар",
        amount: 5
      }, 
      {
        addIng: "Маковая начинка"
      },

      {
        name:"молоко",
        amount: 120
      }, 

      {
        name:"сахар",
        amount: 75
      }, 

      {
        name:"цедра апельсиновая",
        amount: 5
      }, 

      {
        name:"мак молотый",
        amount: 125
      }, 

      {
        name:"корица молотая",
        amount: 2
      }, 

      {
        name:"молоко сгущенное",
        amount: 30
      }, 
    
    ],
    category: "pie",
    detailsProcess: `

    нет данных
    _________
    `
  },

  {
    itemName: "Пирожное школьное",
    description: `Давно хотели узнать, как приготовить пирожные "Школьные" по ГОСТу? Этот рецепт поможет вам почувствовать аромат и приятную рассыпчатую структуру знакомого всем пирожного с повидлом, как в школе`,
    image: "https://avatars.dzeninfra.ru/get-zen_doc/3765046/pub_601c125eb426f776c0c6103a_6048d0feb101ae42d66cca2c/scale_1200",
    id: 18,
    category: "pie",
    detailsProcess: "not data",

  },

  {
    itemName: "Пирожное картошка",
    description: `Любимое пирожное "Картошка" из детства, приготовленное по технологиям ГОСТ в домашних условиях, украсит любое чаепитие.`,
    image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT-sjcY0Xxl5cZpehOIT4n6p047poRM7WinwtqGHuWimzCjn33WwrNUi-YCCi_wlnS_j-E&usqp=CAU",
    id: 19,
    category: "pie",
    detailsProcess: "not data",
    ingredients: [
      {
        doughTitle: "Бисквит: "
      },

      {
        name:"яйца",
        amount: 150
      }, 

      {
        name:"сахар",
        amount: 110
      }, 

      {
        name:"молоко",
        amount: 140
      }, 

      {
        name:"масло раф.",
        amount: 50
      }, 

      {
        name:"мука пш.",
        amount: 150
      }, 

      {
        name:"разрыхлитель",
        amount: 0.5
      }, 

      {
        name:"***какао",
        amount: 60
      }, 

      {
        addIng: "Крем: "
      },
      {
        name:"масло сл. слив. 82%",
        amount: 160
      }, 
      {
        name:"молоко сгущенное",
        amount: 120
      }, 
      {
        name:"ром",
        amount: 20
      }, 
    ]
  }
 
]
